archive/TDS Real-Time sample messages/RetrievePeriodSummariesRequest.xml

<!--REQUEST-->

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
	xmlns:acc="https://services.ird.govt.nz/GWS/Account/" 
	xmlns:ret="https://services.ird.govt.nz/GWS/Account/:types/RetrievePeriodSummariesRequest" 
	xmlns:acc1="urn:www.ird.govt.nz/GWS:types/Account" 
	xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
   <soap:Header/>
   <soap:Body>
      <acc:RetrievePeriodSummaries>
         <acc:RetrievePeriodSummariesRequestMsg>
            <ret:RetrievePeriodSummariesRequestWrapper>
               <acc1:retrievePeriodSummariesRequest>
                  <com:softwareProviderData>
                     <com:softwareProvider>START_SoftwareProvider</com:softwareProvider>
                     <com:softwarePlatform>START_SoftwarePlatform</com:softwarePlatform>
                     <com:softwareRelease>v1</com:softwareRelease>
                  </com:softwareProviderData>
                  <com:identifier IdentifierValueType="IRD">098885123</com:identifier>
                  <!--Required:-->
                  <com:accountType>GST</com:accountType>
               </acc1:retrievePeriodSummariesRequest>
            </ret:RetrievePeriodSummariesRequestWrapper>
         </acc:RetrievePeriodSummariesRequestMsg>
      </acc:RetrievePeriodSummaries>
   </soap:Body>
</soap:Envelope>

